zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/**
  ******************************************************************************
  * @file    stm32h5xx_ll_play.h
  * @brief   Header file of PLAY LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H5xx_LL_PLAY_H
#define STM32H5xx_LL_PLAY_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx.h"

/** @addtogroup STM32H5xx_LL_Driver
  * @{
  */

#if defined(PLAY1)

/** @defgroup PLAY_LL PLAY
  * @{
  */

/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PLAY_LL_Exported_Constants  PLAY Exported Constants
  * @{
  */

/** @defgroup PLAY_LL_EC_LOCK_CONFIG  Lock Configuration Definitions
  * @brief    Configuration definitions which can be used with LL_PLAY_ReadReg and LL_PLAY_WriteReg functions.
  * @{
  */

#define LL_PLAY_CONFIG_LOCK    (0UL)              /*!< Lock Configuration Registers   */
#define LL_PLAY_CONFIG_UNLOCK  PLAY_CFGCR_UNLOCK  /*!< Unlock Configuration Registers */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_INPUT_MULTIPLEXER  Input Multiplexer Definitions
  * @{
  */

#define LL_PLAY_IN0    (0U)  /*!< Input 0             */
#define LL_PLAY_IN1    (1U)  /*!< Input 1             */
#define LL_PLAY_IN2    (2U)  /*!< Input 2             */
#define LL_PLAY_IN3    (3U)  /*!< Input 3             */
#define LL_PLAY_IN4    (4U)  /*!< Input 4             */
#define LL_PLAY_IN5    (5U)  /*!< Input 5             */
#define LL_PLAY_IN6    (6U)  /*!< Input 6             */
#define LL_PLAY_IN7    (7U)  /*!< Input 7             */
#define LL_PLAY_IN8    (8U)  /*!< Input 8             */
#define LL_PLAY_IN9    (9U)  /*!< Input 9             */
#define LL_PLAY_IN10   (10U) /*!< Input 10            */
#define LL_PLAY_IN11   (11U) /*!< Input 11            */
#define LL_PLAY_IN12   (12U) /*!< Input 12            */
#define LL_PLAY_IN13   (13U) /*!< Input 13            */
#define LL_PLAY_IN14   (14U) /*!< Input 14            */
#define LL_PLAY_IN15   (15U) /*!< Input 15            */
#define LL_PLAY_IN_MAX (16U) /*!< Maximum input index */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_LOOKUP_TABLE  Lookup table Definitions
  * @{
  */

/** @defgroup PLAY_LL_EC_LOOKUP_TABLE_INDEX  Lookup table Index Definitions
  * @{
  */

#define LL_PLAY_LUT0    (0U)  /*!< Lookup table 0    */
#define LL_PLAY_LUT1    (1U)  /*!< Lookup table 1    */
#define LL_PLAY_LUT2    (2U)  /*!< Lookup table 2    */
#define LL_PLAY_LUT3    (3U)  /*!< Lookup table 3    */
#define LL_PLAY_LUT4    (4U)  /*!< Lookup table 4    */
#define LL_PLAY_LUT5    (5U)  /*!< Lookup table 5    */
#define LL_PLAY_LUT6    (6U)  /*!< Lookup table 6    */
#define LL_PLAY_LUT7    (7U)  /*!< Lookup table 7    */
#define LL_PLAY_LUT8    (8U)  /*!< Lookup table 8    */
#define LL_PLAY_LUT9    (9U)  /*!< Lookup table 9    */
#define LL_PLAY_LUT10   (10U) /*!< Lookup table 10   */
#define LL_PLAY_LUT11   (11U) /*!< Lookup table 11   */
#define LL_PLAY_LUT12   (12U) /*!< Lookup table 12   */
#define LL_PLAY_LUT13   (13U) /*!< Lookup table 13   */
#define LL_PLAY_LUT14   (14U) /*!< Lookup table 14   */
#define LL_PLAY_LUT15   (15U) /*!< Lookup table 15   */
#define LL_PLAY_LUT_MAX (16U) /*!< Maximum LUT index */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_LOOKUP_TABLE_INPUT  Lookup table Input Definitions
  * @{
  */

#define LL_PLAY_LUT_INPUT0 (0UL) /*!< Lookup table Input 0 */
#define LL_PLAY_LUT_INPUT1 (1UL) /*!< Lookup table Input 1 */
#define LL_PLAY_LUT_INPUT2 (2UL) /*!< Lookup table Input 2 */
#define LL_PLAY_LUT_INPUT3 (3UL) /*!< Lookup table Input 3 */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_LUT_INPUT_SOURCE  Lookup table Input Source Definitions
  * @brief    Lookup table Input Source definitions which can be used with LL_PLAY_WriteReg function.
  * @note     Depending on the lookup table, some LUT direct output sources cannot be connected.
  *           For example, configuring the LUT direct output 0 as input of LUT 4 will
  *           have no effect and the input signal will stay always at 0.
  * @{
  */

#define LL_PLAY_LUT_SOURCE_LUT0_OUT_DIRECT      (0x00UL) /*!< LUT direct output 0              */
#define LL_PLAY_LUT_SOURCE_LUT1_OUT_DIRECT      (0x01UL) /*!< LUT direct output 1              */
#define LL_PLAY_LUT_SOURCE_LUT2_OUT_DIRECT      (0x02UL) /*!< LUT direct output 2              */
#define LL_PLAY_LUT_SOURCE_LUT3_OUT_DIRECT      (0x03UL) /*!< LUT direct output 3              */
#define LL_PLAY_LUT_SOURCE_LUT4_OUT_DIRECT      (0x04UL) /*!< LUT direct output 4              */
#define LL_PLAY_LUT_SOURCE_LUT5_OUT_DIRECT      (0x05UL) /*!< LUT direct output 5              */
#define LL_PLAY_LUT_SOURCE_LUT6_OUT_DIRECT      (0x06UL) /*!< LUT direct output 6              */
#define LL_PLAY_LUT_SOURCE_LUT7_OUT_DIRECT      (0x07UL) /*!< LUT direct output 7              */
#define LL_PLAY_LUT_SOURCE_LUT8_OUT_DIRECT      (0x08UL) /*!< LUT direct output 8              */
#define LL_PLAY_LUT_SOURCE_LUT9_OUT_DIRECT      (0x09UL) /*!< LUT direct output 9              */
#define LL_PLAY_LUT_SOURCE_LUT10_OUT_DIRECT     (0x0AUL) /*!< LUT direct output 10             */
#define LL_PLAY_LUT_SOURCE_LUT11_OUT_DIRECT     (0x0BUL) /*!< LUT direct output 11             */
#define LL_PLAY_LUT_SOURCE_LUT12_OUT_DIRECT     (0x0CUL) /*!< LUT direct output 12             */
#define LL_PLAY_LUT_SOURCE_LUT13_OUT_DIRECT     (0x0DUL) /*!< LUT direct output 13             */
#define LL_PLAY_LUT_SOURCE_LUT14_OUT_DIRECT     (0x0EUL) /*!< LUT direct output 14             */
#define LL_PLAY_LUT_SOURCE_LUT15_OUT_DIRECT     (0x0FUL) /*!< LUT direct output 15             */
#define LL_PLAY_LUT_SOURCE_LUT0_OUT_REGISTERED  (0x10UL) /*!< LUT registered output 0          */
#define LL_PLAY_LUT_SOURCE_LUT1_OUT_REGISTERED  (0x11UL) /*!< LUT registered output 1          */
#define LL_PLAY_LUT_SOURCE_LUT2_OUT_REGISTERED  (0x12UL) /*!< LUT registered output 2          */
#define LL_PLAY_LUT_SOURCE_LUT3_OUT_REGISTERED  (0x13UL) /*!< LUT registered output 3          */
#define LL_PLAY_LUT_SOURCE_LUT4_OUT_REGISTERED  (0x14UL) /*!< LUT registered output 4          */
#define LL_PLAY_LUT_SOURCE_LUT5_OUT_REGISTERED  (0x15UL) /*!< LUT registered output 5          */
#define LL_PLAY_LUT_SOURCE_LUT6_OUT_REGISTERED  (0x16UL) /*!< LUT registered output 6          */
#define LL_PLAY_LUT_SOURCE_LUT7_OUT_REGISTERED  (0x17UL) /*!< LUT registered output 7          */
#define LL_PLAY_LUT_SOURCE_LUT8_OUT_REGISTERED  (0x18UL) /*!< LUT registered output 8          */
#define LL_PLAY_LUT_SOURCE_LUT9_OUT_REGISTERED  (0x19UL) /*!< LUT registered output 9          */
#define LL_PLAY_LUT_SOURCE_LUT10_OUT_REGISTERED (0x1AUL) /*!< LUT registered output 10         */
#define LL_PLAY_LUT_SOURCE_LUT11_OUT_REGISTERED (0x1BUL) /*!< LUT registered output 11         */
#define LL_PLAY_LUT_SOURCE_LUT12_OUT_REGISTERED (0x1CUL) /*!< LUT registered output 12         */
#define LL_PLAY_LUT_SOURCE_LUT13_OUT_REGISTERED (0x1DUL) /*!< LUT registered output 13         */
#define LL_PLAY_LUT_SOURCE_LUT14_OUT_REGISTERED (0x1EUL) /*!< LUT registered output 14         */
#define LL_PLAY_LUT_SOURCE_LUT15_OUT_REGISTERED (0x1FUL) /*!< LUT registered output 15         */
#define LL_PLAY_LUT_SOURCE_FILTER0              (0x20UL) /*!< Signal from Input Multiplexer 0  */
#define LL_PLAY_LUT_SOURCE_FILTER1              (0x21UL) /*!< Signal from Input Multiplexer 1  */
#define LL_PLAY_LUT_SOURCE_FILTER2              (0x22UL) /*!< Signal from Input Multiplexer 2  */
#define LL_PLAY_LUT_SOURCE_FILTER3              (0x23UL) /*!< Signal from Input Multiplexer 3  */
#define LL_PLAY_LUT_SOURCE_FILTER4              (0x24UL) /*!< Signal from Input Multiplexer 4  */
#define LL_PLAY_LUT_SOURCE_FILTER5              (0x25UL) /*!< Signal from Input Multiplexer 5  */
#define LL_PLAY_LUT_SOURCE_FILTER6              (0x26UL) /*!< Signal from Input Multiplexer 6  */
#define LL_PLAY_LUT_SOURCE_FILTER7              (0x27UL) /*!< Signal from Input Multiplexer 7  */
#define LL_PLAY_LUT_SOURCE_FILTER8              (0x28UL) /*!< Signal from Input Multiplexer 8  */
#define LL_PLAY_LUT_SOURCE_FILTER9              (0x29UL) /*!< Signal from Input Multiplexer 9  */
#define LL_PLAY_LUT_SOURCE_FILTER10             (0x2AUL) /*!< Signal from Input Multiplexer 10 */
#define LL_PLAY_LUT_SOURCE_FILTER11             (0x2BUL) /*!< Signal from Input Multiplexer 11 */
#define LL_PLAY_LUT_SOURCE_FILTER12             (0x2CUL) /*!< Signal from Input Multiplexer 12 */
#define LL_PLAY_LUT_SOURCE_FILTER13             (0x2DUL) /*!< Signal from Input Multiplexer 13 */
#define LL_PLAY_LUT_SOURCE_FILTER14             (0x2EUL) /*!< Signal from Input Multiplexer 14 */
#define LL_PLAY_LUT_SOURCE_FILTER15             (0x2FUL) /*!< Signal from Input Multiplexer 15 */
#define LL_PLAY_LUT_SOURCE_SWTRIG0              (0x30UL) /*!< Software Trigger 0               */
#define LL_PLAY_LUT_SOURCE_SWTRIG1              (0x31UL) /*!< Software Trigger 1               */
#define LL_PLAY_LUT_SOURCE_SWTRIG2              (0x32UL) /*!< Software Trigger 2               */
#define LL_PLAY_LUT_SOURCE_SWTRIG3              (0x33UL) /*!< Software Trigger 3               */
#define LL_PLAY_LUT_SOURCE_SWTRIG4              (0x34UL) /*!< Software Trigger 4               */
#define LL_PLAY_LUT_SOURCE_SWTRIG5              (0x35UL) /*!< Software Trigger 5               */
#define LL_PLAY_LUT_SOURCE_SWTRIG6              (0x36UL) /*!< Software Trigger 6               */
#define LL_PLAY_LUT_SOURCE_SWTRIG7              (0x37UL) /*!< Software Trigger 7               */
#define LL_PLAY_LUT_SOURCE_SWTRIG8              (0x38UL) /*!< Software Trigger 8               */
#define LL_PLAY_LUT_SOURCE_SWTRIG9              (0x39UL) /*!< Software Trigger 9               */
#define LL_PLAY_LUT_SOURCE_SWTRIG10             (0x3AUL) /*!< Software Trigger 10              */
#define LL_PLAY_LUT_SOURCE_SWTRIG11             (0x3BUL) /*!< Software Trigger 11              */
#define LL_PLAY_LUT_SOURCE_SWTRIG12             (0x3CUL) /*!< Software Trigger 12              */
#define LL_PLAY_LUT_SOURCE_SWTRIG13             (0x3DUL) /*!< Software Trigger 13              */
#define LL_PLAY_LUT_SOURCE_SWTRIG14             (0x3EUL) /*!< Software Trigger 14              */
#define LL_PLAY_LUT_SOURCE_SWTRIG15             (0x3FUL) /*!< Software Trigger 15              */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_CLOCK_ENABLE  PLAY Lookup table Clock Enable Definitions
  * @brief    Clock Enable definitions which can be used with LL_PLAY_WriteReg function.
  * @{
  */

