zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
#define LL_PLAY_LUT_CLK_GATE_OFF                  (0x00UL) /*!< Clock disabled                   */
#define LL_PLAY_LUT_CLK_GATE_ON                   (0x01UL) /*!< Clock always enabled             */
#define LL_PLAY_LUT_CLK_GATE_SW_ACK               (0x02UL) /*!< SWIN WE signal                   */
#define LL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED  (0x10UL) /*!< LUT registered output 0          */
#define LL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED  (0x11UL) /*!< LUT registered output 1          */
#define LL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED  (0x12UL) /*!< LUT registered output 2          */
#define LL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED  (0x13UL) /*!< LUT registered output 3          */
#define LL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED  (0x14UL) /*!< LUT registered output 4          */
#define LL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED  (0x15UL) /*!< LUT registered output 5          */
#define LL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED  (0x16UL) /*!< LUT registered output 6          */
#define LL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED  (0x17UL) /*!< LUT registered output 7          */
#define LL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED  (0x18UL) /*!< LUT registered output 8          */
#define LL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED  (0x19UL) /*!< LUT registered output 9          */
#define LL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED (0x1AUL) /*!< LUT registered output 10         */
#define LL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED (0x1BUL) /*!< LUT registered output 11         */
#define LL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED (0x1CUL) /*!< LUT registered output 12         */
#define LL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED (0x1DUL) /*!< LUT registered output 13         */
#define LL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED (0x1EUL) /*!< LUT registered output 14         */
#define LL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED (0x1FUL) /*!< LUT registered output 15         */
#define LL_PLAY_LUT_CLK_GATE_FILTER0              (0x20UL) /*!< Signal from input multiplexer 0  */
#define LL_PLAY_LUT_CLK_GATE_FILTER1              (0x21UL) /*!< Signal from input multiplexer 1  */
#define LL_PLAY_LUT_CLK_GATE_FILTER2              (0x22UL) /*!< Signal from input multiplexer 2  */
#define LL_PLAY_LUT_CLK_GATE_FILTER3              (0x23UL) /*!< Signal from input multiplexer 3  */
#define LL_PLAY_LUT_CLK_GATE_FILTER4              (0x24UL) /*!< Signal from input multiplexer 4  */
#define LL_PLAY_LUT_CLK_GATE_FILTER5              (0x25UL) /*!< Signal from input multiplexer 5  */
#define LL_PLAY_LUT_CLK_GATE_FILTER6              (0x26UL) /*!< Signal from input multiplexer 6  */
#define LL_PLAY_LUT_CLK_GATE_FILTER7              (0x27UL) /*!< Signal from input multiplexer 7  */
#define LL_PLAY_LUT_CLK_GATE_FILTER8              (0x28UL) /*!< Signal from input multiplexer 8  */
#define LL_PLAY_LUT_CLK_GATE_FILTER9              (0x29UL) /*!< Signal from input multiplexer 9  */
#define LL_PLAY_LUT_CLK_GATE_FILTER10             (0x2AUL) /*!< Signal from input multiplexer 10 */
#define LL_PLAY_LUT_CLK_GATE_FILTER11             (0x2BUL) /*!< Signal from input multiplexer 11 */
#define LL_PLAY_LUT_CLK_GATE_FILTER12             (0x2CUL) /*!< Signal from input multiplexer 12 */
#define LL_PLAY_LUT_CLK_GATE_FILTER13             (0x2DUL) /*!< Signal from input multiplexer 13 */
#define LL_PLAY_LUT_CLK_GATE_FILTER14             (0x2EUL) /*!< Signal from input multiplexer 14 */
#define LL_PLAY_LUT_CLK_GATE_FILTER15             (0x2FUL) /*!< Signal from input multiplexer 15 */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG0              (0x30UL) /*!< Software trigger 0               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG1              (0x31UL) /*!< Software trigger 1               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG2              (0x32UL) /*!< Software trigger 2               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG3              (0x33UL) /*!< Software trigger 3               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG4              (0x34UL) /*!< Software trigger 4               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG5              (0x35UL) /*!< Software trigger 5               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG6              (0x36UL) /*!< Software trigger 6               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG7              (0x37UL) /*!< Software trigger 7               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG8              (0x38UL) /*!< Software trigger 8               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG9              (0x39UL) /*!< Software trigger 9               */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG10             (0x3AUL) /*!< Software trigger 10              */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG11             (0x3BUL) /*!< Software trigger 11              */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG12             (0x3CUL) /*!< Software trigger 12              */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG13             (0x3DUL) /*!< Software trigger 13              */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG14             (0x3EUL) /*!< Software trigger 14              */
#define LL_PLAY_LUT_CLK_GATE_SWTRIG15             (0x3FUL) /*!< Software trigger 15              */

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_OUTPUT  Output Definitions
  * @{
  */

/** @defgroup PLAY_LL_EC_OUTPUT_MULTIPLEXER  Output Multiplexer Definitions
  * @{
  */

#define LL_PLAY_OUT0    (0U)  /*!< Output 0             */
#define LL_PLAY_OUT1    (1U)  /*!< Output 1             */
#define LL_PLAY_OUT2    (2U)  /*!< Output 2             */
#define LL_PLAY_OUT3    (3U)  /*!< Output 3             */
#define LL_PLAY_OUT4    (4U)  /*!< Output 4             */
#define LL_PLAY_OUT5    (5U)  /*!< Output 5             */
#define LL_PLAY_OUT6    (6U)  /*!< Output 6             */
#define LL_PLAY_OUT7    (7U)  /*!< Output 7             */
#define LL_PLAY_OUT8    (8U)  /*!< Output 8             */
#define LL_PLAY_OUT9    (9U)  /*!< Output 9             */
#define LL_PLAY_OUT10   (10U) /*!< Output 10            */
#define LL_PLAY_OUT11   (11U) /*!< Output 11            */
#define LL_PLAY_OUT12   (12U) /*!< Output 12            */
#define LL_PLAY_OUT13   (13U) /*!< Output 13            */
#define LL_PLAY_OUT14   (14U) /*!< Output 14            */
#define LL_PLAY_OUT15   (15U) /*!< Output 15            */
#define LL_PLAY_OUT_MAX (16U) /*!< Maximum output index */

/**
  * @}
  */

