zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/** @defgroup PLAY_LL_EC_LUT_OUTPUT  Lookup table Output Definitions
  * @{
  */

#define LL_PLAY_LUT0_OUT_DIRECT  PLAY_OSR_LEOUTD0  /*!< LUT direct output 0  */
#define LL_PLAY_LUT1_OUT_DIRECT  PLAY_OSR_LEOUTD1  /*!< LUT direct output 1  */
#define LL_PLAY_LUT2_OUT_DIRECT  PLAY_OSR_LEOUTD2  /*!< LUT direct output 2  */
#define LL_PLAY_LUT3_OUT_DIRECT  PLAY_OSR_LEOUTD3  /*!< LUT direct output 3  */
#define LL_PLAY_LUT4_OUT_DIRECT  PLAY_OSR_LEOUTD4  /*!< LUT direct output 4  */
#define LL_PLAY_LUT5_OUT_DIRECT  PLAY_OSR_LEOUTD5  /*!< LUT direct output 5  */
#define LL_PLAY_LUT6_OUT_DIRECT  PLAY_OSR_LEOUTD6  /*!< LUT direct output 6  */
#define LL_PLAY_LUT7_OUT_DIRECT  PLAY_OSR_LEOUTD7  /*!< LUT direct output 7  */
#define LL_PLAY_LUT8_OUT_DIRECT  PLAY_OSR_LEOUTD8  /*!< LUT direct output 8  */
#define LL_PLAY_LUT9_OUT_DIRECT  PLAY_OSR_LEOUTD9  /*!< LUT direct output 9  */
#define LL_PLAY_LUT10_OUT_DIRECT PLAY_OSR_LEOUTD10 /*!< LUT direct output 10 */
#define LL_PLAY_LUT11_OUT_DIRECT PLAY_OSR_LEOUTD11 /*!< LUT direct output 11 */
#define LL_PLAY_LUT12_OUT_DIRECT PLAY_OSR_LEOUTD12 /*!< LUT direct output 12 */
#define LL_PLAY_LUT13_OUT_DIRECT PLAY_OSR_LEOUTD13 /*!< LUT direct output 13 */
#define LL_PLAY_LUT14_OUT_DIRECT PLAY_OSR_LEOUTD14 /*!< LUT direct output 14 */
#define LL_PLAY_LUT15_OUT_DIRECT PLAY_OSR_LEOUTD15 /*!< LUT direct output 15 */

/*! All LUT direct output */
#define LL_PLAY_LUT_ALL_OUT_DIRECT \
  (LL_PLAY_LUT0_OUT_DIRECT         \
   | LL_PLAY_LUT1_OUT_DIRECT       \
   | LL_PLAY_LUT2_OUT_DIRECT       \
   | LL_PLAY_LUT3_OUT_DIRECT       \
   | LL_PLAY_LUT4_OUT_DIRECT       \
   | LL_PLAY_LUT5_OUT_DIRECT       \
   | LL_PLAY_LUT6_OUT_DIRECT       \
   | LL_PLAY_LUT7_OUT_DIRECT       \
   | LL_PLAY_LUT8_OUT_DIRECT       \
   | LL_PLAY_LUT9_OUT_DIRECT       \
   | LL_PLAY_LUT10_OUT_DIRECT      \
   | LL_PLAY_LUT11_OUT_DIRECT      \
   | LL_PLAY_LUT12_OUT_DIRECT      \
   | LL_PLAY_LUT13_OUT_DIRECT      \
   | LL_PLAY_LUT14_OUT_DIRECT      \
   | LL_PLAY_LUT15_OUT_DIRECT)

#define LL_PLAY_LUT0_OUT_REGISTERED  PLAY_OSR_LEOUTR0  /*!< LUT registered output 0  */
#define LL_PLAY_LUT1_OUT_REGISTERED  PLAY_OSR_LEOUTR1  /*!< LUT registered output 1  */
#define LL_PLAY_LUT2_OUT_REGISTERED  PLAY_OSR_LEOUTR2  /*!< LUT registered output 2  */
#define LL_PLAY_LUT3_OUT_REGISTERED  PLAY_OSR_LEOUTR3  /*!< LUT registered output 3  */
#define LL_PLAY_LUT4_OUT_REGISTERED  PLAY_OSR_LEOUTR4  /*!< LUT registered output 4  */
#define LL_PLAY_LUT5_OUT_REGISTERED  PLAY_OSR_LEOUTR5  /*!< LUT registered output 5  */
#define LL_PLAY_LUT6_OUT_REGISTERED  PLAY_OSR_LEOUTR6  /*!< LUT registered output 6  */
#define LL_PLAY_LUT7_OUT_REGISTERED  PLAY_OSR_LEOUTR7  /*!< LUT registered output 7  */
#define LL_PLAY_LUT8_OUT_REGISTERED  PLAY_OSR_LEOUTR8  /*!< LUT registered output 8  */
#define LL_PLAY_LUT9_OUT_REGISTERED  PLAY_OSR_LEOUTR9  /*!< LUT registered output 9  */
#define LL_PLAY_LUT10_OUT_REGISTERED PLAY_OSR_LEOUTR10 /*!< LUT registered output 10 */
#define LL_PLAY_LUT11_OUT_REGISTERED PLAY_OSR_LEOUTR11 /*!< LUT registered output 11 */
#define LL_PLAY_LUT12_OUT_REGISTERED PLAY_OSR_LEOUTR12 /*!< LUT registered output 12 */
#define LL_PLAY_LUT13_OUT_REGISTERED PLAY_OSR_LEOUTR13 /*!< LUT registered output 13 */
#define LL_PLAY_LUT14_OUT_REGISTERED PLAY_OSR_LEOUTR14 /*!< LUT registered output 14 */
#define LL_PLAY_LUT15_OUT_REGISTERED PLAY_OSR_LEOUTR15 /*!< LUT registered output 15 */

/*! All LUT registered output */
#define LL_PLAY_LUT_ALL_OUT_REGISTERED \
  (LL_PLAY_LUT0_OUT_REGISTERED         \
   | LL_PLAY_LUT1_OUT_REGISTERED       \
   | LL_PLAY_LUT2_OUT_REGISTERED       \
   | LL_PLAY_LUT3_OUT_REGISTERED       \
   | LL_PLAY_LUT4_OUT_REGISTERED       \
   | LL_PLAY_LUT5_OUT_REGISTERED       \
   | LL_PLAY_LUT6_OUT_REGISTERED       \
   | LL_PLAY_LUT7_OUT_REGISTERED       \
   | LL_PLAY_LUT8_OUT_REGISTERED       \
   | LL_PLAY_LUT9_OUT_REGISTERED       \
   | LL_PLAY_LUT10_OUT_REGISTERED      \
   | LL_PLAY_LUT11_OUT_REGISTERED      \
   | LL_PLAY_LUT12_OUT_REGISTERED      \
   | LL_PLAY_LUT13_OUT_REGISTERED      \
   | LL_PLAY_LUT14_OUT_REGISTERED      \
   | LL_PLAY_LUT15_OUT_REGISTERED)

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_SW_TRIGGER  Software Trigger Definitions
  *  @brief   Software Trigger definitions which can be used with LL_PLAY_ReadReg and LL_PLAY_WriteReg functions.
  * @{
  */

#define LL_PLAY_SWTRIG0  PLAY_SWIN_SWIN0  /*!< Software Trigger 0  */
#define LL_PLAY_SWTRIG1  PLAY_SWIN_SWIN1  /*!< Software Trigger 1  */
#define LL_PLAY_SWTRIG2  PLAY_SWIN_SWIN2  /*!< Software Trigger 2  */
#define LL_PLAY_SWTRIG3  PLAY_SWIN_SWIN3  /*!< Software Trigger 3  */
#define LL_PLAY_SWTRIG4  PLAY_SWIN_SWIN4  /*!< Software Trigger 4  */
#define LL_PLAY_SWTRIG5  PLAY_SWIN_SWIN5  /*!< Software Trigger 5  */
#define LL_PLAY_SWTRIG6  PLAY_SWIN_SWIN6  /*!< Software Trigger 6  */
#define LL_PLAY_SWTRIG7  PLAY_SWIN_SWIN7  /*!< Software Trigger 7  */
#define LL_PLAY_SWTRIG8  PLAY_SWIN_SWIN8  /*!< Software Trigger 8  */
#define LL_PLAY_SWTRIG9  PLAY_SWIN_SWIN9  /*!< Software Trigger 9  */
#define LL_PLAY_SWTRIG10 PLAY_SWIN_SWIN10 /*!< Software Trigger 10 */
#define LL_PLAY_SWTRIG11 PLAY_SWIN_SWIN11 /*!< Software Trigger 11 */
#define LL_PLAY_SWTRIG12 PLAY_SWIN_SWIN12 /*!< Software Trigger 12 */
#define LL_PLAY_SWTRIG13 PLAY_SWIN_SWIN13 /*!< Software Trigger 13 */
#define LL_PLAY_SWTRIG14 PLAY_SWIN_SWIN14 /*!< Software Trigger 14 */
#define LL_PLAY_SWTRIG15 PLAY_SWIN_SWIN15 /*!< Software Trigger 15 */

/*! All software triggers */
#define LL_PLAY_SWTRIG_ALL \
  (LL_PLAY_SWTRIG0         \
   | LL_PLAY_SWTRIG1       \
   | LL_PLAY_SWTRIG2       \
   | LL_PLAY_SWTRIG3       \
   | LL_PLAY_SWTRIG4       \
   | LL_PLAY_SWTRIG5       \
   | LL_PLAY_SWTRIG6       \
   | LL_PLAY_SWTRIG7       \
   | LL_PLAY_SWTRIG8       \
   | LL_PLAY_SWTRIG9       \
   | LL_PLAY_SWTRIG10      \
   | LL_PLAY_SWTRIG11      \
   | LL_PLAY_SWTRIG12      \
   | LL_PLAY_SWTRIG13      \
   | LL_PLAY_SWTRIG14      \
   | LL_PLAY_SWTRIG15)

/**
  * @}
  */

