zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/** @defgroup PLAY_LL_EC_GET_FLAG  Get Flags Definitions
  * @brief    Flags definitions which can be used with LL_PLAY_ReadReg function.
  * @{
  */

#define LL_PLAY_ISR_SWINWC    PLAY_ISR_SWINWC    /*!< Software Trigger write complete               */
#define LL_PLAY_ISR_FLCTLWC   PLAY_ISR_FLCTLWC   /*!< Edge Trigger write complete                   */
#define LL_PLAY_ISR_FLAGS     PLAY_ISR_FLAGS     /*!< One or more bits in FLSTAT register is active */
#define LL_PLAY_MSR_SWINWBFS  PLAY_MSR_SWINWBFS  /*!< Software Trigger write busy                   */
#define LL_PLAY_MSR_FLCTLWBFS PLAY_MSR_FLCTLWBFS /*!< Edge Trigger write busy                       */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_IT  IT Definitions
  * @brief    IT definitions which can be used with LL_PLAY_ReadReg and LL_PLAY_WriteReg functions
  * @{
  */

#define LL_PLAY_IER_SWINWC_IEN  PLAY_IER_SWINWC_IEN  /*!< Software Trigger write complete */
#define LL_PLAY_IER_FLCTLWC_IEN PLAY_IER_FLCTLWC_IEN /*!< Edge Trigger write complete     */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_EDGE_TRIGGER_TRANSITION  Output edge trigger transition
  * @{
  */

#define LL_PLAY_LUT_EDGE_TRIGGER_FALLING (0x00000000UL) /*!< Falling edge trigger  */
#define LL_PLAY_LUT_EDGE_TRIGGER_RISING  (0xFFFFFFFFUL) /*!< Rising edge trigger   */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_FILTER_EDGE_DETECTION_MODE  Input Filter Detection Mode Definitions
  * @{
  */

#define LL_PLAY_EDGE_DETECTION_MODE_BYPASSED       (0U)                        /*!< Bypassed mode: No edge detection            */
#define LL_PLAY_EDGE_DETECTION_MODE_RISING         (PLAY_FILTxCFG_EDGEDET_0)   /*!< Rising edge detection mode                  */
#define LL_PLAY_EDGE_DETECTION_MODE_FALLING        (PLAY_FILTxCFG_EDGEDET_1)   /*!< Falling edge detection mode                 */
#define LL_PLAY_EDGE_DETECTION_MODE_RISING_FALLING (PLAY_FILTxCFG_EDGEDET_0 \
                                                    | PLAY_FILTxCFG_EDGEDET_1) /*!< Both rising and falling edge detection mode */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_ATTRIBUTES PLAY Secure/Privilege attributes
  * @{
  */

#define LL_PLAY_ATTR_NSEC  (0U) /*!< Non-secure attribute                            */
#define LL_PLAY_ATTR_SEC   (1U) /*!< Secure attribute on configuration registers     */

#define LL_PLAY_ATTR_NPRIV (0U) /*!< Non-privileged attribute                        */
#define LL_PLAY_ATTR_PRIV  (1U) /*!< Privileged attribute on configuration registers */

/**
  * @}
  */

/** @defgroup PLAY_LL_EC_ITEMS PLAY Attributes Items
  * @{
  */

#define LL_PLAY_SEC_ITEM_CONFIG  (PLAY_SECCFGR_SEC_0)                          /*!< PLAY configuration registers items */
#define LL_PLAY_SEC_ITEM_ALL     (PLAY_SECCFGR_SEC_0 | PLAY_SECCFGR_SEC_1)     /*!< All PLAY registers items           */

#define LL_PLAY_PRIV_ITEM_CONFIG (PLAY_PRIVCFGR_PRIV_0)                        /*!< PLAY configuration registers items */
#define LL_PLAY_PRIV_ITEM_ALL    (PLAY_PRIVCFGR_PRIV_0 | PLAY_PRIVCFGR_PRIV_1) /*!< All PLAY registers items           */


/**
  * @}
  */

/** @defgroup PLAY_LL_EC_GLOBAL Global constants
  * @{
  */

#define LL_PLAY_LUT_INPUT_SOURCE_NBR         (4U)                                                         /*!< Number of input sources per lookup table */
#define LL_PLAY_LUT_TRUTH_TABLE_VALUE_MAX    (PLAY_LExCFG1_LUT_Msk >> PLAY_LExCFG1_LUT_Pos)               /*!< Maximal Lookup table value               */
#define LL_PLAY_INPUT_FILTER_WIDTH_VALUE_MAX (PLAY_FILTxCFG_WIDTH_Msk >> PLAY_FILTxCFG_WIDTH_Pos)         /*!< Maximal pulse width value                */
#define LL_PLAY_IN_SRC_VALUE_MAX             (PLAY_FILTxCFG_PREMUXSEL_Msk >> PLAY_FILTxCFG_PREMUXSEL_Pos) /*!< Max value of premux_sel field            */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup PLAY_LL_Exported_Macros  LL PLAY Macros
  * @{
  */
/** @defgroup PLAY_LL_EM_WRITE_READ  Common Write and Read registers Macros
  * @{
  */

/**
  * @brief  Write a value in PLAY register.
  * @param  instance PLAY Instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_PLAY_WRITE_REG(instance, reg, value)  WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in PLAY register.
  * @param  instance PLAY Instance.
  * @param  reg      Register to be read.
  * @return Register value.
  */
#define LL_PLAY_READ_REG(instance, reg)  READ_REG((instance)->reg)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PLAY_LL_Exported_Functions  PLAY Exported Functions
  * @{
  */

/** @defgroup PLAY_LL_EF_Configuration  Configuration functions
  * @{
  */

/**
  * @brief  Configure the filter of a Logic Array input.
  * @rmtoll
  *  FILTxCFG          PREMUXSEL     LL_PLAY_INPUT_Config \n
  *  FILTxCFG          EDGEDET       LL_PLAY_INPUT_Config \n
  *  FILTxCFG          WIDTH         LL_PLAY_INPUT_Config
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @param  premuxsel_value     Value in range [0..7].
  * @param  edge_detection_mode Value can be one of the following values:
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_BYPASSED
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_FALLING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING_FALLING
  * @param  min_pulse_width Value in range 0x0000 to 0x00FF.
  * @note   This function sets all parameters of a Logic Array input.
  *         These parameters can also be set individually using
  *         dedicated functions:
  *         - @ref LL_PLAY_INPUT_SetMinimumPulseWidth()
  *         - @ref LL_PLAY_INPUT_SetSource()
  *         - @ref LL_PLAY_INPUT_SetEdgeDetectionMode()
  */
__STATIC_INLINE void LL_PLAY_INPUT_Config(PLAY_TypeDef *playx,
                                          uint32_t input_mux, uint32_t premuxsel_value,
                                          uint32_t edge_detection_mode, uint32_t min_pulse_width)
{
  MODIFY_REG(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)],
             (PLAY_FILTxCFG_WIDTH | PLAY_FILTxCFG_EDGEDET | PLAY_FILTxCFG_PREMUXSEL),
             ((min_pulse_width << PLAY_FILTxCFG_WIDTH_Pos) | edge_detection_mode
              | (premuxsel_value << PLAY_FILTxCFG_PREMUXSEL_Pos)));
}

/**
  * @brief  Configure the inputs and the clock enable of a LUT.
  * @rmtoll
  *  LExCFG2          IN_0_SEL     LL_PLAY_LUT_ConfigInputs \n
  *  LExCFG2          IN_1_SEL     LL_PLAY_LUT_ConfigInputs \n
  *  LExCFG2          IN_2_SEL     LL_PLAY_LUT_ConfigInputs \n
  *  LExCFG2          IN_3_SEL     LL_PLAY_LUT_ConfigInputs \n
  *  LExCFG2          CK_SEL       LL_PLAY_LUT_ConfigInputs
  * @param  playx  PLAY Instance.
  * @param  lut    Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @param  source_sel0 Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER0
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER1
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER2
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER3
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER4
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER5
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER6
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER7
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER8
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER9
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER10
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER11
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER12
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER13
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER14
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER15
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG15
  * @param  source_sel1 Value can be one of the values listed for source_sel0.
  * @param  source_sel2 Value can be one of the values listed for source_sel0.
  * @param  source_sel3 Value can be one of the values listed for source_sel0.
  * @param  clk_enable Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_OFF
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_ON
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SW_ACK
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER15
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG15
  * @note   This function sets some parameters of a LUT.
  *         These parameters can also be set individually using
  *         dedicated functions:
  *         - @ref LL_PLAY_LUT_SetSource()
  *         - @ref LL_PLAY_LUT_SetClockGate()
  */
__STATIC_INLINE void LL_PLAY_LUT_ConfigInputs(PLAY_TypeDef *playx, uint32_t lut,
                                              uint32_t source_sel0, uint32_t source_sel1,
                                              uint32_t source_sel2, uint32_t source_sel3,
                                              uint32_t clk_enable)
{
  MODIFY_REG(playx->LECFG2[lut & (LL_PLAY_LUT_MAX - 1U)],
             (PLAY_LExCFG2_IN0_SEL | PLAY_LExCFG2_IN1_SEL | PLAY_LExCFG2_IN2_SEL | PLAY_LExCFG2_IN3_SEL
              | PLAY_LExCFG2_CK_SEL),
             ((source_sel0 << PLAY_LExCFG2_IN0_SEL_Pos) | (source_sel1 << PLAY_LExCFG2_IN1_SEL_Pos)
              | (source_sel2 << PLAY_LExCFG2_IN2_SEL_Pos) | (source_sel3 << PLAY_LExCFG2_IN3_SEL_Pos)
              | (clk_enable << PLAY_LExCFG2_CK_SEL_Pos)));
}

/**
  * @brief  Lock the Configuration registers.
  * @rmtoll
  *  CFGCR        UNLOCK        LL_PLAY_Lock
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_Lock(PLAY_TypeDef *playx)
{
  CLEAR_BIT(playx->CFGCR, PLAY_CFGCR_UNLOCK);
}

/**
  * @brief  Unlock the Configuration registers.
  * @rmtoll
  *  CFGCR        UNLOCK        LL_PLAY_Unlock
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_Unlock(PLAY_TypeDef *playx)
{
  SET_BIT(playx->CFGCR, PLAY_CFGCR_UNLOCK);
}

/**
  * @brief  Indicates whether the PLAY Configuration registers are locked.
  * @rmtoll
  *  CFGCR          UNLOCK        LL_PLAY_IsLocked
  * @param  playx PLAY Instance.
  * @return 1: locked, 0: unlocked.
  */
__STATIC_INLINE uint32_t LL_PLAY_IsLocked(const PLAY_TypeDef *playx)
{
  return (((READ_BIT(playx->CFGCR, PLAY_CFGCR_UNLOCK) == PLAY_CFGCR_UNLOCK) ? 0UL : 1UL));
}

/**
  * @brief  Configure Minimum Pulse Width of an input filter.
  * @rmtoll
  *  FILTxCFG          WIDTH          LL_PLAY_INPUT_SetMinimumPulseWidth
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @param  min_pulse_width Value in range 0x0000 to 0x00FF.
  */
__STATIC_INLINE void LL_PLAY_INPUT_SetMinimumPulseWidth(PLAY_TypeDef *playx, uint32_t input_mux,
                                                        uint32_t min_pulse_width)
{
  MODIFY_REG(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)], PLAY_FILTxCFG_WIDTH,
             (min_pulse_width << PLAY_FILTxCFG_WIDTH_Pos));
}

/**
  * @brief  Get the Minimum Pulse Width.
  * @rmtoll
  *  FILTxCFG          WIDTH          LL_PLAY_INPUT_GetMinimumPulseWidth
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @return Value in range 0x0000 to 0x00FF.
  */
__STATIC_INLINE uint32_t LL_PLAY_INPUT_GetMinimumPulseWidth(const PLAY_TypeDef *playx, uint32_t input_mux)
{
  return (uint32_t)(READ_BIT(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)],
                             PLAY_FILTxCFG_WIDTH) >> PLAY_FILTxCFG_WIDTH_Pos);
}

/**
  * @brief  Configure Filtering Edge mode.
  * @rmtoll
  *  FILTxCFG          EDGEDET     LL_PLAY_INPUT_SetEdgeDetectionMode
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @param  edge_detection_mode Value can be one of the following values:
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_BYPASSED
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_FALLING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING_FALLING
  */
__STATIC_INLINE void LL_PLAY_INPUT_SetEdgeDetectionMode(PLAY_TypeDef *playx, uint32_t input_mux,
                                                        uint32_t edge_detection_mode)
{
  MODIFY_REG(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)], PLAY_FILTxCFG_EDGEDET, edge_detection_mode);
}

/**
  * @brief  Get the Filtering Edge Detection Mode configuration of a PLAY input.
  * @rmtoll
  *  FILTxCFG          EDGEDET     LL_PLAY_INPUT_GetEdgeDetectionMode
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @return Returned Value can be one of the following values:
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_BYPASSED
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_FALLING
  *         @arg @ref LL_PLAY_EDGE_DETECTION_MODE_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_PLAY_INPUT_GetEdgeDetectionMode(const PLAY_TypeDef *playx, uint32_t input_mux)
{
  return (uint32_t)(READ_BIT(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)], PLAY_FILTxCFG_EDGEDET));
}

/**
  * @brief  Configure the signal source of a PLAY input.
  * @rmtoll
  *  FILTxCFG          PREMUXSEL     LL_PLAY_INPUT_SetSource
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @param  source    Value in range [0..7].
  */
__STATIC_INLINE void LL_PLAY_INPUT_SetSource(PLAY_TypeDef *playx, uint32_t input_mux, uint32_t source)
{
  MODIFY_REG(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)], PLAY_FILTxCFG_PREMUXSEL,
             ((uint32_t)source) << PLAY_FILTxCFG_PREMUXSEL_Pos);
}

/**
  * @brief  Return the signal source of a PLAY input.
  * @rmtoll
  *  FILTxCFG          PREMUXSEL     LL_PLAY_INPUT_GetSource
  * @param  playx     PLAY Instance.
  * @param  input_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_IN0
  *         @arg @ref LL_PLAY_IN1
  *         @arg @ref LL_PLAY_IN2
  *         @arg @ref LL_PLAY_IN3
  *         @arg @ref LL_PLAY_IN4
  *         @arg @ref LL_PLAY_IN5
  *         @arg @ref LL_PLAY_IN6
  *         @arg @ref LL_PLAY_IN7
  *         @arg @ref LL_PLAY_IN8
  *         @arg @ref LL_PLAY_IN9
  *         @arg @ref LL_PLAY_IN10
  *         @arg @ref LL_PLAY_IN11
  *         @arg @ref LL_PLAY_IN12
  *         @arg @ref LL_PLAY_IN13
  *         @arg @ref LL_PLAY_IN14
  *         @arg @ref LL_PLAY_IN15
  * @return Premux_sel value in range [0..7].
  */
__STATIC_INLINE uint32_t LL_PLAY_INPUT_GetSource(const PLAY_TypeDef *playx, uint32_t input_mux)
{
  return (READ_BIT(playx->FILTCFG[input_mux & (LL_PLAY_IN_MAX - 1U)],
                   PLAY_FILTxCFG_PREMUXSEL) >> PLAY_FILTxCFG_PREMUXSEL_Pos);
}

