zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/**
  * @brief  Configure the TruthTable value of a Lookup table.
  * @rmtoll
  *  LExCFG1          LUT     LL_PLAY_LUT_SetTruthTable
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @param  truth_table Value in range 0x0000 to 0xFFFF.
  */
__STATIC_INLINE void LL_PLAY_LUT_SetTruthTable(PLAY_TypeDef *playx, uint32_t lut, uint32_t truth_table)
{
  MODIFY_REG(playx->LECFG1[lut], PLAY_LExCFG1_LUT, (truth_table << PLAY_LExCFG1_LUT_Pos));
}

/**
  * @brief  Get the LUT value of a Lookup table.
  * @rmtoll
  *  LExCFG1          LUT     LL_PLAY_LUT_GetTruthTable
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @return Value in range 0x0000 to 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetTruthTable(const PLAY_TypeDef *playx, uint32_t lut)
{
  return (uint32_t)(READ_BIT(playx->LECFG1[lut & (LL_PLAY_LUT_MAX - 1U)], PLAY_LExCFG1_LUT) >> PLAY_LExCFG1_LUT_Pos);
}

/**
  * @brief  Configure an Input of a Lookup table.
  * @rmtoll
  *  LExCFG2          IN0_SEL     LL_PLAY_LUT_SetSource \n
  *  LExCFG2          IN1_SEL     LL_PLAY_LUT_SetSource \n
  *  LExCFG2          IN2_SEL     LL_PLAY_LUT_SetSource \n
  *  LExCFG2          IN3_SEL     LL_PLAY_LUT_SetSource
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @param  input_idx Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_INPUT0
  *         @arg @ref LL_PLAY_LUT_INPUT1
  *         @arg @ref LL_PLAY_LUT_INPUT2
  *         @arg @ref LL_PLAY_LUT_INPUT3
  * @param  source_sel Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER0
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER1
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER2
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER3
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER4
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER5
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER6
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER7
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER8
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER9
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER10
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER11
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER12
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER13
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER14
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER15
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG15
  */
__STATIC_INLINE void LL_PLAY_LUT_SetSource(PLAY_TypeDef *playx, uint32_t lut, uint32_t input_idx, uint32_t source_sel)
{
  MODIFY_REG(playx->LECFG2[lut & (LL_PLAY_LUT_MAX - 1U)],
             (PLAY_LExCFG2_IN0_SEL << (input_idx * PLAY_LExCFG2_IN1_SEL_Pos)),
             (source_sel << (input_idx * PLAY_LExCFG2_IN1_SEL_Pos)));
}

/**
  * @brief  Get the value of an input of a Lookup table.
  * @rmtoll
  *  LExCFG2          IN0_SEL     LL_PLAY_LUT_GetSource \n
  *  LExCFG2          IN1_SEL     LL_PLAY_LUT_GetSource \n
  *  LExCFG2          IN2_SEL     LL_PLAY_LUT_GetSource \n
  *  LExCFG2          IN3_SEL     LL_PLAY_LUT_GetSource
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @param  input_idx Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_INPUT0
  *         @arg @ref LL_PLAY_LUT_INPUT1
  *         @arg @ref LL_PLAY_LUT_INPUT2
  *         @arg @ref LL_PLAY_LUT_INPUT3
  * @return Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER0
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER1
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER2
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER3
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER4
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER5
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER6
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER7
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER8
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER9
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER10
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER11
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER12
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER13
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER14
  *         @arg @ref LL_PLAY_LUT_SOURCE_FILTER15
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_SOURCE_SWTRIG15
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetSource(const PLAY_TypeDef *playx, uint32_t lut, uint32_t input_idx)
{
  return (uint32_t)((READ_BIT(playx->LECFG2[lut & (LL_PLAY_LUT_MAX - 1U)],
                              (PLAY_LExCFG2_IN0_SEL << (input_idx * PLAY_LExCFG2_IN1_SEL_Pos))))
                    >> (input_idx * PLAY_LExCFG2_IN1_SEL_Pos));
}

/**
  * @brief  Configure the Clock Gate of a Lookup table.
  * @rmtoll
  *  LExCFG2          CK_SEL     LL_PLAY_LUT_SetClockGate
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @param  clk_gate Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_OFF
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_ON
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SW_ACK
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER15
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG15
  */
__STATIC_INLINE void LL_PLAY_LUT_SetClockGate(PLAY_TypeDef *playx, uint32_t lut, uint32_t clk_gate)
{
  MODIFY_REG(playx->LECFG2[lut & (LL_PLAY_LUT_MAX - 1U)],
             PLAY_LExCFG2_CK_SEL, clk_gate << PLAY_LExCFG2_CK_SEL_Pos);
}

/**
  * @brief  Get the Clock Gate of a Lookup table.
  * @rmtoll
  *  LExCFG2          CK_SEL     LL_PLAY_LUT_GetClockGate
  * @param  playx PLAY Instance.
  * @param  lut   Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0
  *         @arg @ref LL_PLAY_LUT1
  *         @arg @ref LL_PLAY_LUT2
  *         @arg @ref LL_PLAY_LUT3
  *         @arg @ref LL_PLAY_LUT4
  *         @arg @ref LL_PLAY_LUT5
  *         @arg @ref LL_PLAY_LUT6
  *         @arg @ref LL_PLAY_LUT7
  *         @arg @ref LL_PLAY_LUT8
  *         @arg @ref LL_PLAY_LUT9
  *         @arg @ref LL_PLAY_LUT10
  *         @arg @ref LL_PLAY_LUT11
  *         @arg @ref LL_PLAY_LUT12
  *         @arg @ref LL_PLAY_LUT13
  *         @arg @ref LL_PLAY_LUT14
  *         @arg @ref LL_PLAY_LUT15
  * @return Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_OFF
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_ON
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SW_ACK
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_FILTER15
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG0
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG1
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG2
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG3
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG4
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG5
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG6
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG7
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG8
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG9
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG10
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG11
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG12
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG13
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG14
  *         @arg @ref LL_PLAY_LUT_CLK_GATE_SWTRIG15
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetClockGate(const PLAY_TypeDef *playx, uint32_t lut)
{
  return (uint32_t)(READ_BIT(playx->LECFG2[lut & (LL_PLAY_LUT_MAX - 1U)],
                             PLAY_LExCFG2_CK_SEL) >> PLAY_LExCFG2_CK_SEL_Pos);
}

/**
  * @brief  Get LUT Output status.
  * @rmtoll
  *  OSR          LEOUTD           LL_PLAY_LUT_GetStatus \n
  *  OSR          LEOUTR           LL_PLAY_LUT_GetStatus
  * @param  playx  PLAY Instance.
  * @param  output Value can be a one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  * @note PLAY instance must be locked otherwise OSR register will be on hold.
  * @return State of the bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetStatus(const PLAY_TypeDef *playx, uint32_t output)
{
  return (((READ_BIT(playx->OSR, output) == output) ? 1UL : 0UL));
}

