zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/**
  * @brief  Configure the source of an PLAY output.
  * @rmtoll
  *  OUTxCFG          SEL     LL_PLAY_OUTPUT_SetSource
  * @param  playx      PLAY Instance.
  * @param  output_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_OUT0
  *         @arg @ref LL_PLAY_OUT1
  *         @arg @ref LL_PLAY_OUT2
  *         @arg @ref LL_PLAY_OUT3
  *         @arg @ref LL_PLAY_OUT4
  *         @arg @ref LL_PLAY_OUT5
  *         @arg @ref LL_PLAY_OUT6
  *         @arg @ref LL_PLAY_OUT7
  *         @arg @ref LL_PLAY_OUT8
  *         @arg @ref LL_PLAY_OUT9
  *         @arg @ref LL_PLAY_OUT10
  *         @arg @ref LL_PLAY_OUT11
  *         @arg @ref LL_PLAY_OUT12
  *         @arg @ref LL_PLAY_OUT13
  *         @arg @ref LL_PLAY_OUT14
  *         @arg @ref LL_PLAY_OUT15
  * @param  source Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  */
__STATIC_INLINE void LL_PLAY_OUTPUT_SetSource(PLAY_TypeDef *playx, uint32_t output_mux, uint32_t source)
{
  MODIFY_REG(playx->OUTCFG[output_mux & (LL_PLAY_OUT_MAX - 1U)], PLAY_OUTxCFG_SEL,
             (POSITION_VAL(source)) << PLAY_OUTxCFG_SEL_Pos);
}

/**
  * @brief  Get the source of an PLAY output.
  * @rmtoll
  *  OUTxCFG          SEL     LL_PLAY_OUTPUT_GetSource
  * @param  playx      PLAY Instance.
  * @param  output_mux Value can be one of the following values:
  *         @arg @ref LL_PLAY_OUT0
  *         @arg @ref LL_PLAY_OUT1
  *         @arg @ref LL_PLAY_OUT2
  *         @arg @ref LL_PLAY_OUT3
  *         @arg @ref LL_PLAY_OUT4
  *         @arg @ref LL_PLAY_OUT5
  *         @arg @ref LL_PLAY_OUT6
  *         @arg @ref LL_PLAY_OUT7
  *         @arg @ref LL_PLAY_OUT8
  *         @arg @ref LL_PLAY_OUT9
  *         @arg @ref LL_PLAY_OUT10
  *         @arg @ref LL_PLAY_OUT11
  *         @arg @ref LL_PLAY_OUT12
  *         @arg @ref LL_PLAY_OUT13
  *         @arg @ref LL_PLAY_OUT14
  *         @arg @ref LL_PLAY_OUT15
  * @return Value can be one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  */
__STATIC_INLINE uint32_t LL_PLAY_OUTPUT_GetSource(const PLAY_TypeDef *playx, uint32_t output_mux)
{
  return (uint32_t)(1UL << (READ_BIT(playx->OUTCFG[output_mux & (LL_PLAY_OUT_MAX - 1U)],
                                     PLAY_OUTxCFG_SEL) >> PLAY_OUTxCFG_SEL_Pos));
}

/**
  * @}
  */

/** @defgroup PLAY_LL_EF_SWTRIGGER_Management  Software Trigger Management
  * @{
  */

/**
  * @brief  Set High level to a Software Trigger input.
  * @rmtoll
  *  SWINSET          SWIN           LL_PLAY_SetSWTrigger
  * @param  playx          PLAY Instance.
  * @param  msk_swtriggers Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_SWTRIG0
  *         @arg @ref LL_PLAY_SWTRIG1
  *         @arg @ref LL_PLAY_SWTRIG2
  *         @arg @ref LL_PLAY_SWTRIG3
  *         @arg @ref LL_PLAY_SWTRIG4
  *         @arg @ref LL_PLAY_SWTRIG5
  *         @arg @ref LL_PLAY_SWTRIG6
  *         @arg @ref LL_PLAY_SWTRIG7
  *         @arg @ref LL_PLAY_SWTRIG8
  *         @arg @ref LL_PLAY_SWTRIG9
  *         @arg @ref LL_PLAY_SWTRIG10
  *         @arg @ref LL_PLAY_SWTRIG11
  *         @arg @ref LL_PLAY_SWTRIG12
  *         @arg @ref LL_PLAY_SWTRIG13
  *         @arg @ref LL_PLAY_SWTRIG14
  *         @arg @ref LL_PLAY_SWTRIG15
  *         @arg @ref LL_PLAY_SWTRIG_ALL
  */
__STATIC_INLINE void LL_PLAY_SetSWTrigger(PLAY_TypeDef *playx, uint32_t msk_swtriggers)
{
  SET_BIT(playx->SWINSET, msk_swtriggers);
}

/**
  * @brief  Set Low level to a Software Trigger input.
  * @rmtoll
  *  SWINCLR          SWIN           LL_PLAY_ResetSWTrigger
  * @param  playx          PLAY Instance.
  * @param  msk_swtriggers Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_SWTRIG0
  *         @arg @ref LL_PLAY_SWTRIG1
  *         @arg @ref LL_PLAY_SWTRIG2
  *         @arg @ref LL_PLAY_SWTRIG3
  *         @arg @ref LL_PLAY_SWTRIG4
  *         @arg @ref LL_PLAY_SWTRIG5
  *         @arg @ref LL_PLAY_SWTRIG6
  *         @arg @ref LL_PLAY_SWTRIG7
  *         @arg @ref LL_PLAY_SWTRIG8
  *         @arg @ref LL_PLAY_SWTRIG9
  *         @arg @ref LL_PLAY_SWTRIG10
  *         @arg @ref LL_PLAY_SWTRIG11
  *         @arg @ref LL_PLAY_SWTRIG12
  *         @arg @ref LL_PLAY_SWTRIG13
  *         @arg @ref LL_PLAY_SWTRIG14
  *         @arg @ref LL_PLAY_SWTRIG15
  *         @arg @ref LL_PLAY_SWTRIG_ALL
  */
__STATIC_INLINE void LL_PLAY_ResetSWTrigger(PLAY_TypeDef *playx, uint32_t msk_swtriggers)
{
  SET_BIT(playx->SWINCLR, msk_swtriggers);
}

/**
  * @brief  Get the level of a Software Trigger input.
  * @rmtoll
  *  SWIN          SWIN           LL_PLAY_IsSWTriggerSet
  * @param  playx     PLAY Instance.
  * @param  swtrigger Value can be a one of the following values:
  *         @arg @ref LL_PLAY_SWTRIG0
  *         @arg @ref LL_PLAY_SWTRIG1
  *         @arg @ref LL_PLAY_SWTRIG2
  *         @arg @ref LL_PLAY_SWTRIG3
  *         @arg @ref LL_PLAY_SWTRIG4
  *         @arg @ref LL_PLAY_SWTRIG5
  *         @arg @ref LL_PLAY_SWTRIG6
  *         @arg @ref LL_PLAY_SWTRIG7
  *         @arg @ref LL_PLAY_SWTRIG8
  *         @arg @ref LL_PLAY_SWTRIG9
  *         @arg @ref LL_PLAY_SWTRIG10
  *         @arg @ref LL_PLAY_SWTRIG11
  *         @arg @ref LL_PLAY_SWTRIG12
  *         @arg @ref LL_PLAY_SWTRIG13
  *         @arg @ref LL_PLAY_SWTRIG14
  *         @arg @ref LL_PLAY_SWTRIG15
  * @return State of the bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_PLAY_IsSWTriggerSet(const PLAY_TypeDef *playx, uint32_t swtrigger)
{
  return (((READ_BIT(playx->SWIN, swtrigger) == swtrigger) ? 1UL : 0UL));
}

/**
  * @brief  Toggle the level of Software Trigger input.
  * @rmtoll
  *  SWIN          SWIN           LL_PLAY_ToggleSWTrigger
  * @param  playx          PLAY Instance.
  * @param  msk_swtriggers Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_SWTRIG0
  *         @arg @ref LL_PLAY_SWTRIG1
  *         @arg @ref LL_PLAY_SWTRIG2
  *         @arg @ref LL_PLAY_SWTRIG3
  *         @arg @ref LL_PLAY_SWTRIG4
  *         @arg @ref LL_PLAY_SWTRIG5
  *         @arg @ref LL_PLAY_SWTRIG6
  *         @arg @ref LL_PLAY_SWTRIG7
  *         @arg @ref LL_PLAY_SWTRIG8
  *         @arg @ref LL_PLAY_SWTRIG9
  *         @arg @ref LL_PLAY_SWTRIG10
  *         @arg @ref LL_PLAY_SWTRIG11
  *         @arg @ref LL_PLAY_SWTRIG12
  *         @arg @ref LL_PLAY_SWTRIG13
  *         @arg @ref LL_PLAY_SWTRIG14
  *         @arg @ref LL_PLAY_SWTRIG15
  *         @arg @ref LL_PLAY_SWTRIG_ALL
  */
__STATIC_INLINE void LL_PLAY_ToggleSWTrigger(PLAY_TypeDef *playx, uint32_t msk_swtriggers)
{
  uint32_t curr_swtrigger = READ_REG(playx->SWIN);
  MODIFY_REG(playx->SWIN, msk_swtriggers, (curr_swtrigger ^ msk_swtriggers));
}

/**
  * @}
  */

/** @defgroup PLAY_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable lookup table output flag interrupt.
  * @rmtoll
  *  FLIER          FLAGD_IEN           LL_PLAY_LUT_EnableIT \n
  *  FLIER          FLAGR_IEN           LL_PLAY_LUT_EnableIT
  * @param  playx   PLAY Instance.
  * @param  msk_its Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_REGISTERED
  */
__STATIC_INLINE void LL_PLAY_LUT_EnableIT(PLAY_TypeDef *playx, uint32_t msk_its)
{
  SET_BIT(playx->FLIER, msk_its);
}

/**
  * @brief  Disable lookup table output flag interrupt.
  * @rmtoll
  *  FLIER          FLAGD_IEN           LL_PLAY_LUT_DisableIT \n
  *  FLIER          FLAGR_IEN           LL_PLAY_LUT_DisableIT
  * @param  playx   PLAY Instance.
  * @param  msk_its Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_REGISTERED
  */
__STATIC_INLINE void LL_PLAY_LUT_DisableIT(PLAY_TypeDef *playx, uint32_t msk_its)
{
  CLEAR_BIT(playx->FLIER, msk_its);
}

/**
  * @brief  Check lookup table output flag interrupt.
  * @rmtoll
  *  FLIER          FLAGD_IEN           LL_PLAY_LUT_IsEnabledIT \n
  *  FLIER          FLAGR_IEN           LL_PLAY_LUT_IsEnabledIT
  * @param  playx PLAY Instance.
  * @param  flag  Value can be a one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsEnabledIT(const PLAY_TypeDef *playx, uint32_t flag)
{
  return ((READ_BIT(playx->FLIER, flag) == flag) ? 1U : 0U);
}

/**
  * @brief  Get the lookup table output flag interrupt mask.
  * @rmtoll
  *  FLIER          FLAGD_IEN           LL_PLAY_LUT_GetIT \n
  *  FLIER          FLAGR_IEN           LL_PLAY_LUT_GetIT
  * @param  playx PLAY Instance.
  * @return Mask of enabled Lookup table output interrupts.
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetIT(const PLAY_TypeDef *playx)
{
  return (READ_REG(playx->FLIER));
}

/**
  * @brief  Enable Software Trigger write complete interrupt.
  * @rmtoll
  *  IER          SWINWC_IEN           LL_PLAY_EnableIT_SWTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_EnableIT_SWTriggerWriteComplete(PLAY_TypeDef *playx)
{
  SET_BIT(playx->IER, PLAY_IER_SWINWC_IEN);
}

/**
  * @brief  Disable Software Trigger write complete interrupt.
  * @rmtoll
  *  IER          SWINWC_IEN           LL_PLAY_DisableIT_SWTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_DisableIT_SWTriggerWriteComplete(PLAY_TypeDef *playx)
{
  CLEAR_BIT(playx->IER, PLAY_IER_SWINWC_IEN);
}

/**
  * @brief  Check Software Trigger write complete interrupt.
  * @rmtoll
  *  IER          SWINWC_IEN           LL_PLAY_IsEnabledIT_SWTriggerWriteComplete
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_IsEnabledIT_SWTriggerWriteComplete(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->IER, PLAY_IER_SWINWC_IEN) == PLAY_IER_SWINWC_IEN) ? 1U : 0U);
}

/**
  * @brief  Enable Edge Trigger write complete interrupt.
  * @rmtoll
  *  IER          FLCTLWC_IEN           LL_PLAY_LUT_EnableIT_EdgeTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_LUT_EnableIT_EdgeTriggerWriteComplete(PLAY_TypeDef *playx)
{
  SET_BIT(playx->IER, PLAY_IER_FLCTLWC_IEN);
}

/**
  * @brief  Disable Edge Trigger write complete interrupt.
  * @rmtoll
  *  IER          FLCTLWC_IEN           LL_PLAY_LUT_DisableIT_EdgeTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_LUT_DisableIT_EdgeTriggerWriteComplete(PLAY_TypeDef *playx)
{
  CLEAR_BIT(playx->IER, PLAY_IER_FLCTLWC_IEN);
}

/**
  * @brief  Check Edge Trigger write complete interrupt.
  * @rmtoll
  *  IER          FLCTLWC_IEN           LL_PLAY_LUT_IsEnabledIT_EdgeTriggerWriteComplete
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsEnabledIT_EdgeTriggerWriteComplete(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->IER, PLAY_IER_FLCTLWC_IEN) == PLAY_IER_FLCTLWC_IEN) ? 1U : 0U);
}

/**
  * @}
  */

/** @defgroup PLAY_LL_EF_FLAG_Management  FLAG Management
  * @{
  */

/**
  * @brief  Set flag transition of all lookup table outputs.
  * @rmtoll
  *  FLCTL          FLAGD_EDGE          LL_PLAY_LUT_ConfigEdgeTrigger \n
  *  FLCTL          FLAGR_EDGE          LL_PLAY_LUT_ConfigEdgeTrigger
  * @param  playx            PLAY Instance.
  * @param  msk_rising_flags Mask of flags to configure on rising edge.
  *         The others flag  will be configured on falling edge.
  *         The value of this parameter can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_REGISTERED
  * @note   To configure some transitions without impacting the others use the function
  *         @ref LL_PLAY_LUT_SetEdgeTrigger().
  */
__STATIC_INLINE void LL_PLAY_LUT_ConfigEdgeTrigger(PLAY_TypeDef *playx, uint32_t msk_rising_flags)
{
  WRITE_REG(playx->FLCTL, msk_rising_flags);
}

