zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/**
  * @brief  Set flag transition for lookup table output.
  * @rmtoll
  *  FLCTL          FLAGD_EDGE          LL_PLAY_LUT_SetEdgeTrigger \n
  *  FLCTL          FLAGR_EDGE          LL_PLAY_LUT_SetEdgeTrigger
  * @param  playx           PLAY Instance.
  * @param  msk_out_falling Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_REGISTERED
  * @param  msk_out_rising Value can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT_ALL_OUT_REGISTERED
  * @note   To configure all transitions (Rising & Falling), by only one call,
  *         use function @ref LL_PLAY_LUT_ConfigEdgeTrigger().
  */
__STATIC_INLINE void LL_PLAY_LUT_SetEdgeTrigger(PLAY_TypeDef *playx, uint32_t msk_out_falling,
                                                uint32_t msk_out_rising)
{
  uint32_t msk_flags = msk_out_falling | msk_out_rising;
  MODIFY_REG(playx->FLCTL, msk_flags, msk_out_rising);
}

/**
  * @brief  Get flag transitions of all lookup table outputs.
  * @rmtoll
  *  FLCTL          FLAGD_EDGE          LL_PLAY_LUT_GetEdgeTrigger \n
  *  FLCTL          FLAGR_EDGE          LL_PLAY_LUT_GetEdgeTrigger
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetEdgeTrigger(const PLAY_TypeDef *playx)
{
  return READ_REG(playx->FLCTL);
}

/**
  * @brief  Check lookup table output flag status.
  * @rmtoll
  *  FLSTAT          FLAGD          LL_PLAY_LUT_IsActiveFlag \n
  *  FLSTAT          FLAGR          LL_PLAY_LUT_IsActiveFlag
  * @param  playx PLAY Instance.
  * @param  flag  Value can be a one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsActiveFlag(const PLAY_TypeDef *playx, uint32_t flag)
{
  return ((READ_BIT(playx->FLSTAT, flag) == flag) ? 1U : 0U);
}

/**
  * @brief  Clear lookup table output flag.
  * @rmtoll
  *  FLCLR          FLAGD_CLR       LL_PLAY_LUT_ClearFlag \n
  *  FLCLR          FLAGR_CLR       LL_PLAY_LUT_ClearFlag
  * @param  playx PLAY Instance.
  * @param  msk_flags  Value can be a one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  */
__STATIC_INLINE void LL_PLAY_LUT_ClearFlag(PLAY_TypeDef *playx, uint32_t msk_flags)
{
  SET_BIT(playx->FLCLR, msk_flags);
}

/**
  * @brief  Set lookup table output flag.
  * @rmtoll
  *  FLSET          FLAGD_SET       LL_PLAY_LUT_SetFlag \n
  *  FLSET          FLAGR_SET       LL_PLAY_LUT_SetFlag
  * @param  playx PLAY Instance.
  * @param  msk_flags  Value can be a one of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  * @note   The peripheral allows to activate by software the LUT Output flags
  *         for debugging case.
  */
__STATIC_INLINE void LL_PLAY_LUT_SetFlag(PLAY_TypeDef *playx, uint32_t msk_flags)
{
  SET_BIT(playx->FLSET, msk_flags);
}

/**
  * @brief  Retrieve the status of all lookup table flags.
  * @rmtoll
  *  FLSTAT          FLAGD          LL_PLAY_LUT_GetFlags \n
  *  FLSTAT          FLAGR          LL_PLAY_LUT_GetFlags
  * @param  playx PLAY Instance.
  * @return Flags status (bit mask).
  *         This value can be a combination of the following values:
  *         @arg @ref LL_PLAY_LUT0_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT1_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT2_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT3_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT4_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT5_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT6_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT7_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT8_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT9_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT10_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT11_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT12_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT13_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT14_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT15_OUT_DIRECT
  *         @arg @ref LL_PLAY_LUT0_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT1_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT2_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT3_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT4_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT5_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT6_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT7_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT8_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT9_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT10_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT11_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT12_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT13_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT14_OUT_REGISTERED
  *         @arg @ref LL_PLAY_LUT15_OUT_REGISTERED
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_GetFlags(const PLAY_TypeDef *playx)
{
  return READ_REG(playx->FLSTAT);
}

/**
  * @brief  Check Software Trigger write busy flag status.
  * @rmtoll
  *  MSR          SWINWBFS          LL_PLAY_IsSWTriggerWriteBusy
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_IsSWTriggerWriteBusy(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->MSR, PLAY_MSR_SWINWBFS) == PLAY_MSR_SWINWBFS) ? 1U : 0U);
}

/**
  * @brief  Check Software Trigger write complete flag status.
  * @rmtoll
  *  ISR          SWINWC          LL_PLAY_IsSWTriggerWriteComplete
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_IsSWTriggerWriteComplete(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->ISR, PLAY_ISR_SWINWC) == PLAY_ISR_SWINWC) ? 1U : 0U);
}
/**
  * @brief  Clear Software Trigger write complete flag.
  * @rmtoll
  *  ICR          SWINWC_CLR       LL_PLAY_ClearFlag_SWTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_ClearFlag_SWTriggerWriteComplete(PLAY_TypeDef *playx)
{
  SET_BIT(playx->ICR, PLAY_ICR_SWINWC_CLR);
}

/**
  * @brief  Check Edge Trigger write busy flag status.
  * @rmtoll
  *  MSR          FLCTLWBFS          LL_PLAY_LUT_IsEdgeTriggerWriteBusy
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsEdgeTriggerWriteBusy(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->MSR, PLAY_MSR_FLCTLWBFS) == PLAY_MSR_FLCTLWBFS) ? 1U : 0U);
}

/**
  * @brief  Check Edge Trigger write complete flag status.
  * @rmtoll
  *  ISR          FLCTLWC          LL_PLAY_LUT_IsEdgeTriggerWriteComplete
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsEdgeTriggerWriteComplete(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->ISR, PLAY_ISR_FLCTLWC) == PLAY_ISR_FLCTLWC) ? 1U : 0U);
}

/**
  * @brief  Clear Edge Trigger write complete flag.
  * @rmtoll
  *  ICR          FLCTLWC_CLR       LL_PLAY_LUT_ClearFlag_EdgeTriggerWriteComplete
  * @param  playx PLAY Instance.
  */
__STATIC_INLINE void LL_PLAY_LUT_ClearFlag_EdgeTriggerWriteComplete(PLAY_TypeDef *playx)
{
  SET_BIT(playx->ICR, PLAY_ICR_FLCTLWC_CLR);
}

/**
  * @brief  Check Flags flag status.
  * @rmtoll
  *  ISR          FLAGS          LL_PLAY_LUT_IsActiveFlag_FLAGS
  * @param  playx PLAY Instance.
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PLAY_LUT_IsActiveFlag_FLAGS(const PLAY_TypeDef *playx)
{
  return ((READ_BIT(playx->ISR, PLAY_ISR_FLAGS) == PLAY_ISR_FLAGS) ? 1U : 0U);
}

/**
  * @}
  */

