zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_ll_play.h
/** @defgroup PLAY_LL_EF_Privilege_Services Privilege Services
  * @{
  */

/**
  * @brief  Set the privileged access level attribute for item(s).
  * @rmtoll
  *  PRIVCFGR          PRIV          LL_PLAY_SetPrivAttr
  * @param  playx PLAY Instance.
  * @param  item This parameter can be one or a combination of the following values:
  *         @arg @ref LL_PLAY_PRIV_ITEM_CONFIG
  *         @arg @ref LL_PLAY_PRIV_ITEM_ALL
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_PLAY_ATTR_NPRIV
  *        @arg @ref LL_PLAY_ATTR_PRIV
  */
__STATIC_INLINE void LL_PLAY_SetPrivAttr(PLAY_TypeDef *playx, uint32_t item, uint32_t priv_attr)
{
  MODIFY_REG(playx->PRIVCFGR, PLAY_PRIVCFGR_PRIV, (item & ((~priv_attr) + 1U)));
}

/**
  * @brief  Get the privileged access level attribute of an item.
  * @rmtoll
  *  PRIVCFGR          PRIV          LL_PLAY_GetPrivAttr
  * @param  playx PLAY Instance.
  * @param  item This parameter can be one of the following values:
  *         @arg @ref LL_PLAY_PRIV_ITEM_CONFIG
  *         @arg @ref LL_PLAY_PRIV_ITEM_ALL
  * @return Current privileged level attributes:
  *         @arg @ref LL_PLAY_ATTR_NPRIV
  *         @arg @ref LL_PLAY_ATTR_PRIV
  */
__STATIC_INLINE uint32_t LL_PLAY_GetPrivAttr(const PLAY_TypeDef *playx, uint32_t item)
{
  return ((READ_BIT(playx->PRIVCFGR, item) == item) ? LL_PLAY_ATTR_PRIV : LL_PLAY_ATTR_NPRIV);
}

/**
  * @}
  */

/** @defgroup PLAY_LL_EF_Security_Services Security Services
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the security access level attribute for item(s).
  * @rmtoll
  *  SECCFGR           SEC          LL_PLAY_SetSecAttr
  * @param  playx PLAY Instance.
  * @param  item This parameter can be one or a combination of the following values:
  *         @arg @ref LL_PLAY_SEC_ITEM_CONFIG
  *         @arg @ref LL_PLAY_SEC_ITEM_ALL
  * @param sec_attr This parameter can be one of the following values:
  *        @arg @ref LL_PLAY_ATTR_NSEC
  *        @arg @ref LL_PLAY_ATTR_SEC
  */
__STATIC_INLINE void LL_PLAY_SetSecAttr(PLAY_TypeDef *playx, uint32_t item, uint32_t sec_attr)
{
  MODIFY_REG(playx->SECCFGR, PLAY_SECCFGR_SEC, (item & ((~sec_attr) + 1U)));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Get the security access level attribute of an item.
  * @rmtoll
  *  SECCFGR           SEC          LL_PLAY_GetSecAttr
  * @param  playx PLAY Instance.
  * @param  item This parameter can be one of the following values:
  *         @arg @ref LL_PLAY_SEC_ITEM_CONFIG
  *         @arg @ref LL_PLAY_SEC_ITEM_ALL
  * @return Current security level attributes:
  *         @arg @ref LL_PLAY_ATTR_NSEC
  *         @arg @ref LL_PLAY_ATTR_SEC
  */
__STATIC_INLINE uint32_t LL_PLAY_GetSecAttr(const PLAY_TypeDef *playx, uint32_t item)
{
  return ((READ_BIT(playx->SECCFGR, item) == item) ? LL_PLAY_ATTR_SEC : LL_PLAY_ATTR_NSEC);
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup PLAY_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_PLAY_DeInit(PLAY_TypeDef *PLAYx);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* PLAY1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32H5xx_LL_PLAY_H */
